trade_exp/src/InformationRegisters/СочетанияКритериевДляТиповТС/СочетанияКритериевДляТиповТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="61f172b0-eadc-465d-94ef-4b0f6ae6ac6a">
  <name>СочетанияКритериевДляТиповТС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="4543fa8e-227b-403a-8cd9-23577495e7e1">
    <name>ТипТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ebc5df4d-4cc6-487e-845c-3a394c059b88">
    <name>КритерийСовместимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c2eedc97-82bf-4d9b-b0a6-36bbe42984d7">
    <name>КритерийНесовместимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СочетанияКритериевДляТиповТС/Forms/ФормаЗагрузки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЦветОшибки = Новый Цвет(255,0,0);
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	НомерСтроки = 2;
	
	Пока Истина Цикл
		СтатусОшибки = Ложь;
		стрНомерСтроки = Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		ТипТранспортногоСредства = ПолучитьСсылкуПоНаименованию(стрНомерСтроки, 1, "ТипыТранспортныхСредств", СтатусОшибки);
		КритерийСовместимости    = ПолучитьСсылкуПоНаименованию(стрНомерСтроки, 2, "КритерииДляТиповТС", СтатусОшибки);
		КритерийНесовместимости  = ПолучитьСсылкуПоНаименованию(стрНомерСтроки, 3, "КритерииДляТиповТС", СтатусОшибки);
		
		Если Не СтатусОшибки Тогда
			Если ЗначениеЗаполнено(ТипТранспортногоСредства) Тогда
				Если КритерийСовместимости <> КритерийНесовместимости Тогда  
					НаборЗаписей = РегистрыСведений.СочетанияКритериевДляТиповТС.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ТипТранспортногоСредства.Установить(ТипТранспортногоСредства);
					НаборЗаписей.Отбор.КритерийСовместимости.Установить(КритерийСовместимости);
					НаборЗаписей.Отбор.КритерийНесовместимости.Установить(КритерийНесовместимости);
					
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 0 Тогда
						НоваяЗапись = НаборЗаписей.Добавить();
					Иначе
						НоваяЗапись = НаборЗаписей[0];
					КонецЕсли;
					
					НоваяЗапись.ТипТранспортногоСредства = ТипТранспортногоСредства;
					НоваяЗапись.КритерийСовместимости = КритерийСовместимости;
					НоваяЗапись.КритерийНесовместимости = КритерийНесовместимости;		
					
					Попытка
						НаборЗаписей.Записать();
					Исключение
						ЗафиксироватьОшибку("Ошибка при записи данных в регистр!", стрНомерСтроки, 1, 3);
					КонецПопытки;
				Иначе
					Если ЗначениеЗаполнено(КритерийСовместимости) Тогда
						ЗафиксироватьОшибку("Критерий совместимости не должен быть равен критерию несовместимости!", стрНомерСтроки, 2, 3);
					Иначе
						ЗафиксироватьОшибку("Необходимо заполнить критерий совместимости, либо критерий несовместимости!", стрНомерСтроки, 2, 3);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(КритерийСовместимости) И Не ЗначениеЗаполнено(КритерийНесовместимости) Тогда
					ОбщегоНазначения.СообщитьПользователю("Операция выполнена!");
					Прервать;
				Иначе
					ЗафиксироватьОшибку("Не заполнен тип транспортного средства!", стрНомерСтроки, 1); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьОшибку(ТекстОшибки, НомерСтроки, Ячейка1, Ячейка2 = Неопределено)
	Если ЗначениеЗаполнено(Ячейка2) Тогда
		ТабличныйДокумент.Область("R" + НомерСтроки + "C" + Ячейка1 + ":R" + НомерСтроки + "C" + Ячейка2).ЦветФона = ЦветОшибки;
	Иначе
		ТабличныйДокумент.Область("R" + НомерСтроки + "C" + Ячейка1).ЦветФона = ЦветОшибки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + НомерСтроки + "C4").Текст) Тогда
		ТабличныйДокумент.Область("R" + НомерСтроки + "C4").Текст = ТабличныйДокумент.Область("R" + НомерСтроки + "C4").Текст + Символы.ПС + ТекстОшибки;
	Иначе
		ТабличныйДокумент.Область("R" + НомерСтроки + "C4").Текст = ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуПоНаименованию(НомерСтроки, НомерКолонки, ТипСсылки, СтатусОшибки)
	Наименование = СокрЛП(ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомерКолонки).Текст);
	
	Если Не ПустаяСтрока(Наименование) Тогда	
		Запрос = Новый Запрос;
		ЗапросТекст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Объект.Ссылка КАК Ссылка
			|ИЗ
			|	#Объект КАК Объект
			|ГДЕ
			|	Объект.Наименование = &Наименование
			|	И НЕ Объект.ПометкаУдаления";
		
		Запрос.Текст = СтрЗаменить(ЗапросТекст, "#Объект", "Справочник." + ТипСсылки);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();	
		Если РезультатЗапроса.Следующий() И ЗначениеЗаполнено(РезультатЗапроса.Ссылка) Тогда
			Возврат РезультатЗапроса.Ссылка;
		Иначе
			ЗафиксироватьОшибку("Не удалось найти '" + Наименование + "' в базе! Возможно, выбранное значение помечено на удаление!", НомерСтроки, НомерКолонки);
			СтатусОшибки = Истина;
		КонецЕсли;
	КонецЕсли;                                  
	
	Возврат Справочники[ТипСсылки].ПустаяСсылка();
КонецФункции
